Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: إن ربكم الله الذي خلق السماوات والأرض في ستة أيام ثم استوى على العرش يدبر الأمر ما من شفيع إلا من بعد إذنه ذلكم الله ربكم فاعبدوه أفلا تذكرون
en: Surely, your Lord is Allah Who created the heavens and the earth in six Days and then rose over (Istawa ) the Throne (really in a manner that suits His Majesty), disposing the affair of all things. No intercessor (can plead with Him) except after His Leave. That is Allah, your Lord; so worship Him (Alone). Then, will you not remember?

source: إليه مرجعكم جميعا وعد الله حقا إنه يبدأ الخلق ثم يعيده ليجزي الذين آمنوا وعملوا الصالحات بالقسط والذين كفروا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون
en: To Him is the return of all of you. The Promise of Allah is true. It is He Who begins the creation and then will repeat it, that He may reward with justice those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness. But those who disbelieved will have a drink of boiling fluids and painful torment because they used to disbelieve.

source: هو الذي جعل الشمس ضياء والقمر نورا وقدره منازل لتعلموا عدد السنين والحساب ما خلق الله ذلك إلا بالحق يفصل الآيات لقوم يعلمون
en: It is He Who made the sun a shining thing and the moon as a light and measured out for it stages that you might know the number of years and the reckoning. Allah did not create this but in truth. He explains the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) in detail for people who have knowledge.

source: إن في اختلاف الليل والنهار وما خلق الله في السماوات والأرض لآيات لقوم يتقون
en: Verily, in the alternation of the night and the day and in all that Allah has created in the heavens and the earth are Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) for those people who keep their duty to Allah, and fear Him much.

source: إن الذين لا يرجون لقاءنا ورضوا بالحياة الدنيا واطمأنوا بها والذين هم عن آياتنا غافلون
en: Verily, those who hope not for their meeting with Us, but are pleased and satisfied with the life of the present world, and those who are heedless of Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.),

source: أولئك مأواهم النار بما كانوا يكسبون
en: Those, their abode will be the Fire, because of what they used to earn.

source: إن الذين آمنوا وعملوا الصالحات يهديهم ربهم بإيمانهم تجري من تحتهم الأنهار في جنات النعيم
en: Verily, those who believe, and do deeds of righteousness, their Lord will guide them through their Faith; under them will flow rivers in the Gardens of Delight (Paradise).

source: دعواهم فيها سبحانك اللهم وتحيتهم فيها سلام وآخر دعواهم أن الحمد لله رب العالمين
en: Their way of request therein will be Subhanaka Allahumma (Glory to You, O Allah!) and Salam (peace, safety from evil) will be their greetings therein (Paradise)! and the close of their request will be: Al-Hamdu Lillahi Rabb-il-'Alamin [All the praises and thanks be to Allah, the Lord of 'Alamin (mankind, jinn and all that exists)].

source: ولو يعجل الله للناس الشر استعجالهم بالخير لقضي إليهم أجلهم فنذر الذين لا يرجون لقاءنا في طغيانهم يعمهون
en: And were Allah to hasten for mankind the evil (they invoke for themselves and for their children. while in a state of anger) as He hastens for them the good (they invoke) then they would have been ruined. So We leave those who expect not their meeting with Us, in their trespasses, wandering blindly in distraction. (Tafsir At-Tabari)

source: وإذا مس الإنسان الضر دعانا لجنبه أو قاعدا أو قائما فلما كشفنا عنه ضره مر كأن لم يدعنا إلى ضر مسه كذلك زين للمسرفين ما كانوا يعملون
en: And when harm touches man, he invokes Us, lying on his side, or sitting or standing. But when We have removed his harm from him, he passes on as if he had never invoked Us for a harm that touched him! Thus it is made fair-seeming to the Musrifun that which they used to do.

source: ولقد أهلكنا القرون من قبلكم لما ظلموا وجاءتهم رسلهم بالبينات وما كانوا ليؤمنوا كذلك نجزي القوم المجرمين
en: And indeed, We destroyed generations before you when they did wrong, while their Messengers came to them with clear proofs, but they were not such as to believe! Thus do We requite the people who are Mujrimun (disbelievers, polytheists, sinners, criminals).

source: ثم جعلناكم خلائف في الأرض من بعدهم لننظر كيف تعملون
en: Then We made you successors after them, generations after generations in the land, that We might see how you would work.

source: وإذا تتلى عليهم آياتنا بينات قال الذين لا يرجون لقاءنا ائت بقرآن غير هذا أو بدله قل ما يكون لي أن أبدله من تلقاء نفسي إن أتبع إلا ما يوحى إلي إني أخاف إن عصيت ربي عذاب يوم عظيم
en: And when Our clear Verses are recited unto them, those who hope not for their meeting with Us, say: "Bring us a Qur'an other than this, or change it." Say (O Muhammad صلى الله عليه وسلم): "It is not for me to change it on my own accord; I only follow that which is revealed unto me. Verily, I fear the torment of the Great Day (i.e. the Day of Resurrection) if I were to disobey my Lord."

source: قل لو شاء الله ما تلوته عليكم ولا أدراكم به فقد لبثت فيكم عمرا من قبله أفلا تعقلون
en: Say (O Muhammad صلى الله عليه وسلم): "If Allah had so willed, I should not have recited it to you nor would He have made it known to you. Verily, I have stayed amongst you a life time before this. Have you then no sense?"

source: فمن أظلم ممن افترى على الله كذبا أو كذب بآياته إنه لا يفلح المجرمون
en: So who does more wrong than he who forges a lie against Allah or denies His Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.)? Surely, the Mujrimun (criminals, sinners, disbelievers and polytheists) will never be successful!

source: ويعبدون من دون الله ما لا يضرهم ولا ينفعهم ويقولون هؤلاء شفعاؤنا عند الله قل أتنبئون الله بما لا يعلم في السماوات ولا في الأرض سبحانه وتعالى عما يشركون
en: And they worship besides Allah things that harm them not, nor profit them, and they say: "These are our intercessors with Allah." Say: "Do you inform Allah of that which He knows not in the heavens and on the earth?" Glorified and Exalted is He above all that which they associate as partners (with Him)!

source: وما كان الناس إلا أمة واحدة فاختلفوا ولولا كلمة سبقت من ربك لقضي بينهم فيما فيه يختلفون
en: Mankind were but one community (i.e. on one religion - Islamic Monotheism), then they differed (later); and had not it been for a Word that went forth before from your Lord, it would have been settled between them regarding what they differed .

source: ويقولون لولا أنزل عليه آية من ربه فقل إنما الغيب لله فانتظروا إني معكم من المنتظرين
en: And they say: "How is it that not a sign is sent down on him from his Lord?" Say: "The Unseen belongs to Allah Alone, so wait you, verily, I am with you among those who wait (for Allah's Judgement)."

source: وإذا أذقنا الناس رحمة من بعد ضراء مستهم إذا لهم مكر في آياتنا قل الله أسرع مكرا إن رسلنا يكتبون ما تمكرون
en: And when We let mankind taste mercy after some adversity has afflicted them, behold! they take to plotting against Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.)! Say: "Allah is more Swift in planning!" Certainly, Our Messengers (angels) record all of that which you plot.

source: هو الذي يسيركم في البر والبحر حتى إذا كنتم في الفلك وجرين بهم بريح طيبة وفرحوا بها جاءتها ريح عاصف وجاءهم الموج من كل مكان وظنوا أنهم أحيط بهم دعوا الله مخلصين له الدين لئن أنجيتنا من هذه لنكونن من الشاكرين
en: He it is Who enables you to travel through land and sea, till when you are in the ships, and they sail with them with a favourable wind, and they are glad therein, then comes a stormy wind and the waves come to them from all sides, and they think that they are encircled therein. Then they invoke Allah, making their Faith pure for Him Alone, (saying): "If You (Allah) deliver us from this, we shall truly be of the grateful."

source: فلما أنجاهم إذا هم يبغون في الأرض بغير الحق يا أيها الناس إنما بغيكم على أنفسكم متاع الحياة الدنيا ثم إلينا مرجعكم فننبئكم بما كنتم تعملون
en: But when He delivers them, behold! they rebel (disobey Allah) in the earth wrongfully. O mankind! Your rebellion (disobedience to Allah) is only against your ownselves, - a brief enjoyment of this worldly life, then (in the end) unto Us is your return, and We shall inform you of that which you used to do.

source: إنما مثل الحياة الدنيا كماء أنزلناه من السماء فاختلط به نبات الأرض مما يأكل الناس والأنعام حتى إذا أخذت الأرض زخرفها وازينت وظن أهلها أنهم قادرون عليها أتاها أمرنا ليلا أو نهارا فجعلناها حصيدا كأن لم تغن بالأمس كذلك نفصل الآيات لقوم يتفكرون
en: Verily, the likeness of (this) worldly life is as the water (rain) which We send down from the sky; so by it arises the intermingled produce of the earth of which men and cattle eat: until when the earth is clad in its adornments and is beautified, and its people think that they have all the powers of disposal over it, Our Command reaches it by night or by day and We make it like a clean-mown harvest, as if it had not flourished yesterday! Thus do We explain the Ayat (proofs, evidence, verses, lessons, signs, revelations, laws, etc.) in detail for the people who reflect.

source: والله يدعو إلى دار السلام ويهدي من يشاء إلى صراط مستقيم
en: Allah calls to the Home of Peace (i.e. Paradise, by accepting Allah's religion of Islamic Monotheism and by doing righteous good deeds and abstaining from polytheism and evil deeds) and guides whom He wills to the Straight Path.

source: للذين أحسنوا الحسنى وزيادة ولا يرهق وجوههم قتر ولا ذلة أولئك أصحاب الجنة هم فيها خالدون
en: For those who have done good is the best (reward, i.e. Paradise) and even more (i.e. having the honour of glancing at the Countenance of Allah جل جلاله). Neither darkness nor dust nor any humiliating disgrace shall cover their faces. They are the dwellers of Paradise, they will abide therein forever.

source: والذين كسبوا السيئات جزاء سيئة بمثلها وترهقهم ذلة ما لهم من الله من عاصم كأنما أغشيت وجوههم قطعا من الليل مظلما أولئك أصحاب النار هم فيها خالدون
en: And those who have earned evil deeds, the recompense of an evil deed is the like thereof, and humiliating disgrace will cover them (their faces). No defender will they have from Allah. Their faces will be covered as it were with pieces from the darkness of night. They are the dwellers of the Fire, they will abide therein forever.

source: ويوم نحشرهم جميعا ثم نقول للذين أشركوا مكانكم أنتم وشركاؤكم فزيلنا بينهم وقال شركاؤهم ما كنتم إيانا تعبدون
en: And the Day whereon We shall gather them all together, then We shall say to those who did set partners in worship with Us: "Stop at your place! You and your partners (whom you had worshipped in the worldly life)." then We shall separate them, and their (Allah's so-called) partners shall say: "It was not us that you used to worship."

source: فكفى بالله شهيدا بيننا وبينكم إن كنا عن عبادتكم لغافلين
en: "So sufficient is Allah as a witness between us and you that we indeed knew nothing of your worship of us."

source: هنالك تبلو كل نفس ما أسلفت وردوا إلى الله مولاهم الحق وضل عنهم ما كانوا يفترون
en: There! Every person will know (exactly) what he had earned before and they will be brought back to Allah, their rightful Maula (Lord), and their invented false deities will vanish from them.

source: قل من يرزقكم من السماء والأرض أمن يملك السمع والأبصار ومن يخرج الحي من الميت ويخرج الميت من الحي ومن يدبر الأمر فسيقولون الله فقل أفلا تتقون
en: Say (O Muhammad صلى الله عليه وسلم): "Who provides for you from the sky and the earth? Or who owns hearing and sight? And who brings out the living from the dead and brings out the dead from the living? And who disposes the affairs?" They will say: "Allah." Say: "Will you not then be afraid of Allah's punishment (for setting up rivals in worship with Allah)?"

source: فذلكم الله ربكم الحق فماذا بعد الحق إلا الضلال فأنى تصرفون
en: Such is Allah, your Lord in truth. So after the truth, what else can there be, save error? How then are you turned away?

source: كذلك حقت كلمت ربك على الذين فسقوا أنهم لا يؤمنون
en: Thus is the Word of your Lord justified against those who rebel (disobey Allah) that they will not believe (in the Oneness of Allah and in Muhammad صلى الله عليه وسلم as the Messenger of Allah).

source: قل هل من شركائكم من يبدأ الخلق ثم يعيده قل الله يبدأ الخلق ثم يعيده فأنى تؤفكون
en: Say: "Is there of your (Allah's called) partners one that originates the creation and then repeats it?" Say: "Allah originates the creation and then He repeats it. Then how are you deluded away (from the truth)?"

source: قل هل من شركائكم من يهدي إلى الحق قل الله يهدي للحق أفمن يهدي إلى الحق أحق أن يتبع أمن لا يهدي إلا أن يهدى فما لكم كيف تحكمون
en: Say: "Is there of your (Allah's so-called) partners one that guides to the truth?" Say: "It is Allah Who guides to the truth. Is then He Who guides to the truth more worthy to be followed, or he who finds not guidance (himself) unless he is guided? Then, what is the matter with you? How judge you?"

source: وما يتبع أكثرهم إلا ظنا إن الظن لا يغني من الحق شيئا إن الله عليم بما يفعلون
en: And most of them follow nothing but conjecture. Certainly, conjecture can be of no avail against the truth. Surely, Allah is All-Aware of what they do.

source: وما كان هذا القرآن أن يفترى من دون الله ولكن تصديق الذي بين يديه وتفصيل الكتاب لا ريب فيه من رب العالمين
en: And this Qur'an is not such as could ever be produced by other than Allah (Lord of the heavens and the earth), but it is a confirmation of (the revelation) which was before it [i.e. the Taurat (Torah), and the Injeel (Gospel)], and a full explanation of the Book (i.e. laws, decreed for mankind) - wherein there is no doubt - from the Lord of the 'Alamin (mankind, jinn, and all that exists).

source: أم يقولون افتراه قل فأتوا بسورة مثله وادعوا من استطعتم من دون الله إن كنتم صادقين
en: Or do they say: "He (Muhammad صلى الله عليه وسلم) has forged it?" Say: "Bring then a Surah (chapter) like unto it, and call upon whomsoever you can besides Allah, if you are truthful!"

source: بل كذبوا بما لم يحيطوا بعلمه ولما يأتهم تأويله كذلك كذب الذين من قبلهم فانظر كيف كان عاقبة الظالمين
en: Nay, they have belied the knowledge whereof they could not comprehend and what has not yet been fulfilled (i.e. their punishment). Thus those before them did belie. Then see what was the end of the Zalimun (polytheists and wrong-doers)!

source: ومنهم من يؤمن به ومنهم من لا يؤمن به وربك أعلم بالمفسدين
en: And of them there are some who believe therein; and of them there are some who believe not therein, and your Lord is All-Aware of the Mufsidun (evil-doers, liars).

source: وإن كذبوك فقل لي عملي ولكم عملكم أنتم بريئون مما أعمل وأنا بريء مما تعملون
en: And if they belie you, say: "For me are my deeds and for you are your deeds! You are innocent of what I do, and I am innocent of what you do!"

source: ومنهم من يستمعون إليك أفأنت تسمع الصم ولو كانوا لا يعقلون
en: And among them are some who listen to you, but can you make the deaf to hear - even though they apprehend not?

source: ومنهم من ينظر إليك أفأنت تهدي العمي ولو كانوا لا يبصرون
en: And among them are some who look at you, but can you guide the blind - even though they see not?

source: إن الله لا يظلم الناس شيئا ولكن الناس أنفسهم يظلمون
en: Truly! Allah wrongs not mankind in aught; but mankind wrong themselves.

source: ويوم يحشرهم كأن لم يلبثوا إلا ساعة من النهار يتعارفون بينهم قد خسر الذين كذبوا بلقاء الله وما كانوا مهتدين
en: And on the Day when He shall gather (resurrect) them together, (it will be) as if they had not stayed (in the life of this world and graves) but an hour of a day. They will recognise each other. Ruined indeed will be those who denied the Meeting with Allah, and were not guided.

source: وإما نرينك بعض الذي نعدهم أو نتوفينك فإلينا مرجعهم ثم الله شهيد على ما يفعلون
en: Whether We show you (in your lifetime, O Muhammad صلى الله عليه وسلم) some of what We promise them (the torment), or We cause you to die - still unto Us is their return, and moreover, Allah is Witness over what they used to do.

source: ولكل أمة رسول فإذا جاء رسولهم قضي بينهم بالقسط وهم لا يظلمون
en: And for every Ummah (a community or a nation) there is a Messenger; when their Messenger comes, the matter will be judged between them with justice, and they will not be wronged.

source: ويقولون متى هذا الوعد إن كنتم صادقين
en: And they say: "When will be this promise (the torment or the Day of Resurrection), if you speak the truth?"

source: قل لا أملك لنفسي ضرا ولا نفعا إلا ما شاء الله لكل أمة أجل إذا جاء أجلهم فلا يستأخرون ساعة ولا يستقدمون
en: Say (O Muhammad صلى الله عليه وسلم): "I have no power over any harm or profit to myself except what Allah may will. For every Ummah (a community or a nation), there is a term appointed; when their term comes, neither can they delay it nor can they advance it an hour (or a moment)." (Tafsir Al-Qurtubi).

source: قل أرأيتم إن أتاكم عذابه بياتا أو نهارا ماذا يستعجل منه المجرمون
en: Say: "Tell me, if His torment should come to you by night or by day, which portion thereof would the Mujrimun (disbelievers, polytheists, sinners, criminals) hasten on ?"

source: أثم إذا ما وقع آمنتم به آلآن وقد كنتم به تستعجلون
en: Is it then that when it has actually befallen, you will believe in it? What! Now (you believe)? And you used (aforetime) to hasten it on!"

source: ثم قيل للذين ظلموا ذوقوا عذاب الخلد هل تجزون إلا بما كنتم تكسبون
en: Then it will be said to them who wronged themselves: "Taste you the everlasting torment! Are you recompensed (aught) save what you used to earn?"

source: ويستنبئونك أحق هو قل إي وربي إنه لحق وما أنتم بمعجزين
en: And they ask you (O Muhammad صلى الله عليه وسلم) to inform them (saying): "Is it true (i.e. the torment and the establishment of the Hour - the Day of Resurrection)?" Say: "Yes! By my Lord! It is the very truth! and you cannot escape it!"

source: ولو أن لكل نفس ظلمت ما في الأرض لافتدت به وأسروا الندامة لما رأوا العذاب وقضي بينهم بالقسط وهم لا يظلمون
en: And if every person who had wronged (by disbelieving in Allah and by worshipping others besides Allah) possessed all that is on the earth and sought to ransom himself therewith (it will not be accepted), and they would feel in their hearts regret when they see the torment, and they will be judged with justice, and no wrong will be done unto them.

source: ألا إن لله ما في السماوات والأرض ألا إن وعد الله حق ولكن أكثرهم لا يعلمون
en: No doubt, surely, all that is in the heavens and the earth belongs to Allah. No doubt, surely, Allah's Promise is true. But most of them know not.

source: هو يحيي ويميت وإليه ترجعون
en: It is He Who gives life, and causes death, and to Him you (all) shall return.

source: يا أيها الناس قد جاءتكم موعظة من ربكم وشفاء لما في الصدور وهدى ورحمة للمؤمنين
en: O mankind! There has come to you a good advice from your Lord (i.e. the Qur'an, enjoining all that is good and forbidding all that is evil), and a healing for that (disease of ignorance, doubt, hypocrisy and differences) which is in your breasts, - a guidance and a mercy (explaining lawful and unlawful things) for the believers.

source: قل بفضل الله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون
en: Say: "In the Bounty of Allah, and in His Mercy (i.e. Islam and the Qur'an); - therein let them rejoice." That is better than what (the wealth) they amass.

source: قل أرأيتم ما أنزل الله لكم من رزق فجعلتم منه حراما وحلالا قل آلله أذن لكم أم على الله تفترون
en: Say (O Muhammad صلى الله عليه وسلم to these polytheists): "Tell me, what provision Allah has sent down to you! And you have made of it lawful and unlawful." Say (O Muhammad صلى الله عليه وسلم): "Has Allah permitted you (to do so), or do you invent a lie against Allah?"

source: وما ظن الذين يفترون على الله الكذب يوم القيامة إن الله لذو فضل على الناس ولكن أكثرهم لا يشكرون
en: And what think those who invent a lie against Allah, on the Day of Resurrection? [i.e. Do they think that they will be forgiven and excused! Nay, they will have an eternal punishment in the Fire of Hell]. Truly, Allah is full of Bounty to mankind, but most of them are ungrateful.

source: وما تكون في شأن وما تتلو منه من قرآن ولا تعملون من عمل إلا كنا عليكم شهودا إذ تفيضون فيه وما يعزب عن ربك من مثقال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر إلا في كتاب مبين
en: Neither you (O Muhammad صلى الله عليه وسلم) do any deed nor recite any portion of the Qur'an, - nor you (mankind) do any deed (good or evil) but We are Witness thereof, when you are doing it. And nothing is hidden from your Lord (so much as) the weight of an atom (or small ant) on the earth or in the heaven. Not what is less than that or what is greater than that but is (written) in a Clear Record. (Tafsir At-Tabari).

source: ألا إن أولياء الله لا خوف عليهم ولا هم يحزنون
en: No doubt! Verily, the Auliya' of Allah [i.e. those who believe in the Oneness of Allah and fear Allah much (abstain from all kinds of sins and evil deeds which he has forbidden), and love Allah much (perform all kinds of good deeds which He has ordained)], no fear shall come upon them nor shall they grieve.

source: الذين آمنوا وكانوا يتقون
en: Those who believed (in the Oneness of Allah - Islamic Monotheism), and used to fear Allah much (by abstaining from evil deeds and sins and by doing righteous deeds).

source: لهم البشرى في الحياة الدنيا وفي الآخرة لا تبديل لكلمات الله ذلك هو الفوز العظيم
en: For them are glad tidings, in the life of the present world (i.e. through a righteous dream seen by the person himself or shown to others), and in the Hereafter. No change can there be in the Words of Allah. This is indeed the supreme success.

source: ولا يحزنك قولهم إن العزة لله جميعا هو السميع العليم
en: And let not their speech grieve you (O Muhammad صلى الله عليه وسلم), for all power and honour belong to Allah. He is the All-Hearer, the All-Knower.

source: ألا إن لله من في السماوات ومن في الأرض وما يتبع الذين يدعون من دون الله شركاء إن يتبعون إلا الظن وإن هم إلا يخرصون
en: No doubt! Verily, to Allah belongs whosoever is in the heavens and whosoever is in the earth. And those who worship and invoke others besides Allah, in fact they follow not (Allah's so-called) partners, they follow only a conjecture and they only invent lies.

source: هو الذي جعل لكم الليل لتسكنوا فيه والنهار مبصرا إن في ذلك لآيات لقوم يسمعون
en: He it is Who has appointed for you the night that you may rest therein, and the day to make things visible (to you). Verily, in this are Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) for a people who listen (i.e. those who think deeply).

source: قالوا اتخذ الله ولدا سبحانه هو الغني له ما في السماوات وما في الأرض إن عندكم من سلطان بهذا أتقولون على الله ما لا تعلمون
en: They (Jews, Christians and pagans) say: "Allah has begotten a son (children)." Glory is to Him! He is Rich (Free of all needs). His is all that is in the heavens and all that is in the earth. No warrant you have for this. Do you say against Allah what you know not.

source: قل إن الذين يفترون على الله الكذب لا يفلحون
en: Say: "Verily, those who invent a lie against Allah will never be successful" -

source: متاع في الدنيا ثم إلينا مرجعهم ثم نذيقهم العذاب الشديد بما كانوا يكفرون
en: (A brief) enjoyment in this world! - and then unto Us will be their return, then We shall make them taste the severest torment because they used to disbelieve [in Allah, belie His Messengers, deny and challenge His Ayat (proofs, signs, verses, etc.)].
